ci4/app/Controllers/Artikel.php

    public function add()
    {
        // Validation...
        $validation = \Config\Services::validation();
        $validation->setRules(['judul' => 'required']);
        $isDataValid = $validation->withRequest($this->request)->run();
        if (
            $isDataValid &&
            $this->request->getMethod() == 'POST' && $this->validate([
                'judul' => 'required',
                        'id_kategori' => 'required|integer' // Ensure id_kategori is required and an integer
            ])
        ) {
            $file = $this->request->getFile('gambar');
            $file->move(ROOTPATH . 'public/gambar');
            $model = new ArtikelModel();
            $model->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'gambar' => $file->getName(),
            ]);
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `id_kategori`, `gambar`) VALUES ('Resep masakan nenek', 'asdasdfsadfdadf', 'Resep-masakan-nenek', '1', 'Screenshot (6).png')

    public function edit($id)
    {
        $model = new ArtikelModel();

        if (
            $this->request->getMethod() == 'POST' && $this->validate([
                'judul' => 'required',
                'id_kategori' => 'required|integer'
            ])
        ) {
            $file = $this->request->getFile('gambar');
            $file->move(ROOTPATH . 'public/gambar');
            $model->update($id, [
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'gambar' => $file->getName(),
            ]);

            return redirect()->to('/admin/artikel');
        } else {
            $data['artikel'] = $model->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'

    public function delete($id)
    {
        $model = new ArtikelModel();
        $model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('4')

    public function view($slug)
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->where('slug', $slug)->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = 'Artikel-Pertama'
 LIMIT 1